//3.Дано ціле число N. Необхідно вивести всі точні квадрати натуральних
//чисел, що не перевищують цього числа N.
let N = 100;
let i = 1;
while(i*i<=N){
    console.log(i*i);
    i++;
}


//22.Знайти суму чисел від 100 до 200 кратних 17.
let sum = 0;
for (let i=100; i<=200; i++){
    if(i%17===0){
        sum+=i;
    }
}
console.log(sum);


//30. З клавіатури вводяться числа і підсумовуються. Знайти кількість
//введених чисел, коли їхня сума перевищила 100.
let sum = 0;
let count = 0;
while (sum <= 100) {
  const input = prompt('Введіть число:');
  const num = Number(input);
  sum += num;
  count++;
}
console.log(count);


//18 . Дані натуральні числа від 20 до 50. Надрукувати ті з них, які діляться
//на 3, але не діляться на 5.
for (let i = 20; i <= 50; i++){
   if(i%3 === 0 && i%5 !== 0){
        console.log(i);
    }
}


//6. Написати програму, яка показуватиме на екран квадрат числа, введеного
//користувачем. Користувач повинен сам вирішувати – вийти із програми або
//продовжити введення.
while (true)
{
  let N = prompt("Введіть число:");
  if (N === null || N === " "){
    break;
  }
  N = parseFloat(N);
  let square = N * N;
  console.log(`Квадрат числа ${N} дорівнює ${N*N}`);
  let continueInput = confirm("Продовжити введення чисел?");
  if (!continueInput){
    break; 
  }
}
console.log("Програма завершила роботу");


