function searchCar() {
    const carNumberInput = document.getElementById("car-number");
    const carNumber = carNumberInput.value.toUpperCase();
    if (carNumber.length !== 8) { 
      alert("Введіть номер автомобіля у форматі АО1234КО");
      console.log(regionCode);
      return;
    }
  
    const regionCode = carNumber.slice(0,2);
    const regions = {
        "АА": "Київ",
        "AІ": "Київська область",
        "АН": "Донецька область",
        "ВВ": "Луганська область",
        "АР": "Запорізька область",
        "АХ": "Харківська область",
        "АЕ": "Дніпропетровська область",
        "ВТ": "Херсонська область",
        "ВЕ": "Миколаївська область",
        "ВН": "Одеська область",
        "ВА": "Кіровоградська область",
        "ВІ": "Полтавська область",
        "ВМ": "Сумська область",
        "СВ": "Чернігівська область",
        "СА": "Черкаська область",
        "АВ": "Вінницька область",
        "АМ": "Житомирська область",
        "ВХ": "Хмельницька область",
        "СЕ": "Чернівецька область",
        "ВК": "Рівненська область",
        "ВО": "Тернопільська область",
        "АС": "Волинська область",
        "ВС": "Львівська область",
        "АТ": "Івано-Франківська область",
        "АО": "Закарпатська область",
    }
    const regionName = regions[regionCode];

    alert(`Автомобіль з номером ${carNumber} зареєстровано в області ${regionName}`);
}
