/*1. Дано масив, який містить оцінки студента з К предметів. Знайти середній бал студента і
з’ясувати до якої категорії він відноситься (відмінник (всі оцінки відмінно), двійочник (має хоча
би одну двійку), хорошист (оцінки добре і відмінно), трійочник (є хоча би одна трійка)).*/

let Marks = [2,5,3,5,4,4,3,5,5]
let average = Marks.reduce((sum,amount)=>sum+amount,0)/Marks.length;
if(Marks.includes(2) == true){
    alert("Двійочник");
} else if(Marks.includes(3)){
    alert("Трійочник");
} else if(Marks.includes(4)){
    alert("Хорошист");
} else{
    alert("Відмінник")
}