/*Дано одновимірний масив, у якому зберігається певна виграшна сума (елементи
заповнюються випадковим чином значеннями від -500 до 500). Користувач вибирає номер
елементу, поки не відмовиться від подальшої гри, або не вибере всі елементи. Після кожного
ходу показувати сумарний виграш. Кожен елемент можна вибирати тільки 1 раз.
*/

let winnings = [];
for (let i = 0; i < 10; i++) {
  winnings.push(Math.floor(Math.random() * 1001) - 500); 
}

let totalWin = 0; 
let i = 0; 

while (i < winnings.length) {
  let choice = confirm(`Ваш виграш: ${totalWin}. Виберіть ${i+1}-й елемент (${winnings[i]}): натисніть "ОК", щоб взяти гроші, або "Скасувати", щоб продовжити грати.`);
  if (choice) {
    totalWin += winnings[i];
  }
  i++;
}

alert(`Гра закінчена. Ваш загальний виграш: ${totalWin}.`);








